title: Curl Web Request With Potential Custom User-Agent
id: 85de1f22-d189-44e4-8239-dc276b45379b
status: test
description: Detects execution of "curl.exe" with a potential custom "User-Agent". Attackers can leverage this to download or exfiltrate data via "curl" to a domain that only accept specific "User-Agent" strings
references:
    - https://labs.withsecure.com/publications/fin7-target-veeam-servers
    - https://github.com/WithSecureLabs/iocs/blob/344203de742bb7e68bd56618f66d34be95a9f9fc/FIN7VEEAM/iocs.csv
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-07-27
modified: 2026-07-06
tags:
    - attack.execution
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith: '\curl.exe'
        - OriginalFileName: 'curl.exe'
    selection_header_short:
        CommandLine|re: '(?i)(^|\s|")-H\s*"?\s*User-Agent\s*:'
    selection_header_long:
        CommandLine|contains|all:
            - '--header'
            - 'User-Agent:'
    selection_user_agent_long:
        CommandLine|contains: '--user-agent'
    selection_user_agent_short:
        CommandLine|re: '(^|\s|")-A(\s|")'
    condition: selection_img and 1 of selection_header_* or selection_img and 1 of selection_user_agent_*
falsepositives:
    - Unknown
level: medium